{
  "backend/main.mo": "Motoko actor defining the Vitalis Water claim backend with functions to submit, retrieve, update, filter, and search coupon submissions stored in a Map.",
  "backend/migration.mo": "Migration module that initializes a fresh NewActor state with an empty submissions Map, used during canister upgrades.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (logo replacement, visual overhaul, reward probabilities, claim form, etc.) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line summaries of every frontend source file, serving as a quick reference for the project's frontend structure.",
  "frontend/index.css": "Base Tailwind CSS entry point defining CSS custom property tokens for light and dark themes (colors, radius, chart, sidebar variables).",
  "frontend/index.html": "HTML shell for the Vitalis Water Scratch & Win app, mounting the React app at #root and loading main.tsx as an ES module.",
  "frontend/src/App.tsx": "Root React component that performs simple client-side routing, rendering ScratchPage at '/' and AdminPanel at '/admin' via popstate events.",
  "frontend/src/components/ClaimForm.tsx": "Glassmorphism claim form component with State dropdown, City, UPI ID, and Feedback fields that validates inputs and calls the backend submitClaim mutation on submission.",
  "frontend/src/components/Confetti.tsx": "Canvas-based confetti burst component animating 120 blue/white/gold particles with physics over ~3.5 seconds, triggered once on reward reveal while playing a winning chime.",
  "frontend/src/components/ConfirmationNotification.tsx": "Full-screen overlay confirmation component with animated checkmark, ripple rings, bouncing coin emojis, and a success message that auto-dismisses after 6 seconds.",
  "frontend/src/components/Footer.tsx": "Renders a site footer with the Vitalis Water logo, copyright, tagline, a caffeine.ai attribution link, and an optional admin navigation link.",
  "frontend/src/components/Hero.tsx": "Displays the hero section with a 'Scan. Scratch. Win.' tagline, a bottle image with emoji fallback, and a subtitle.",
  "frontend/src/components/Logo.tsx": "Renders the Vitalis Water logo image in a header, with a water-drop emoji fallback if the image fails to load.",
  "frontend/src/components/RewardReveal.tsx": "Shows a reward reveal card displaying the won cashback amount and a claim button; renders nothing when not visible.",
  "frontend/src/components/ScratchCard.tsx": "Renders an interactive scratch card with a canvas overlay using the useScratchCanvas hook, showing the reward amount beneath and a scratch-progress hint.",
  "frontend/src/components/WaterDropIntro.tsx": "Animates a full-screen canvas intro with falling water drops over ~2.2 seconds, then calls onComplete when the animation finishes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout helpers, status flags, and an AuthClient backed by DFINITY's auth-client library.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching submissions, reward stats, searching by coupon prefix, and submitting a claim against the ICP backend actor.",
  "frontend/src/hooks/useScratchCanvas.ts": "Manages scratch-card canvas logic: initializes a textured silver overlay, handles pointer/touch events to erase pixels, calculates scratch progress, and triggers onReveal when the threshold is met.",
  "frontend/src/index.css": "Global CSS for the Vitalis Water app, defining brand color tokens, Tailwind imports, and layout/component styles including the deep-blue gradient background, page container, logo section, and various UI utility classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AdminPanel.tsx": "Password-protected admin dashboard page that displays all coupon submissions fetched from the backend, with search filtering, reward breakdown stats, and logout functionality.",
  "frontend/src/pages/ScratchPage.tsx": "Main user-facing page orchestrating the full scratch-card flow: intro animation, scratch card reveal, confetti, claim form display, and confirmation notification, using a randomly generated reward and unique code.",
  "frontend/src/utils/audioGenerator.ts": "Provides two Web Audio API functions—playScratchSound (bandpass-filtered noise burst) and playWinningChime (ascending C-major arpeggio)—generated programmatically without external audio files.",
  "frontend/src/utils/rewardGenerator.ts": "Exports generateReward (weighted random selection across ₹10–₹100 tiers) and generateUniqueCode (random VW-XXXX-XXXX alphanumeric string) used to initialize each scratch-card session.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with brand colors, custom shadows, border radii, font families, and animation keyframes, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest (version 5) documenting the Vitalis Water Scratch & Win campaign architecture, reward probabilities, existing features, known issues, and image requirements for build planning."
}