{
  "backend/main.mo": "Motoko actor defining the backend for a scratch-and-win app, with endpoints for submitting coupon claims, managing user profiles, querying/filtering submissions, and marking coupons as redeemed, using an in-memory Map for storage and role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: updating reward probability distribution in rewardGenerator.ts and handling the 'Better Luck Next Time' outcome gracefully across ScratchCard, ScratchPage, and RewardReveal components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key implementation details of each component, hook, utility, and page in the Vitalis Water scratch-and-win frontend.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom property tokens for light and dark themes covering colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the Vitalis Water Scratch & Win app, mounting the React app at the #root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component managing navigation between ScratchPage and AdminPanel views, handling admin authentication via sessionStorage, and syncing view state with browser history via popstate events.",
  "frontend/src/components/AdminLoginModal.tsx": "Modal dialog component for admin login that validates hardcoded email/password credentials and calls onSuccess or displays an error message accordingly.",
  "frontend/src/components/ClaimForm.tsx": "Glassmorphism claim form component that collects state, city, UPI ID, and feedback from the user, submits the claim via a React Query mutation, and shows a success confirmation or user-friendly error message.",
  "frontend/src/components/Confetti.tsx": "Renders a canvas-based confetti animation with particles when `triggered` is true, and plays a winning chime sound once on trigger.",
  "frontend/src/components/ConfirmationNotification.tsx": "Displays an animated modal notification confirming a reward payment with a checkmark, ripple effect, coin animations, and auto-closes after 6 seconds.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with the Vitalis logo, copyright year, tagline, and a referral link to caffeine.ai.",
  "frontend/src/components/Hero.tsx": "Displays the hero section with a 'Scan. Scratch. Win.' tagline, a bottle image with emoji fallback, and a subtitle.",
  "frontend/src/components/Logo.tsx": "Renders the Vitalis Water logo image with a text/emoji fallback and an optional double-click handler.",
  "frontend/src/components/RewardReveal.tsx": "Shows a reward card displaying the won amount in rupees and a button to scroll down to the claim form.",
  "frontend/src/components/ScratchCard.tsx": "Renders an interactive scratch card using a canvas overlay that reveals either a cash reward or a 'better luck' result once 60% is scratched.",
  "frontend/src/components/WaterDropIntro.tsx": "Animates a full-screen canvas intro with falling water drops over a gradient background for ~2.2 seconds, then calls `onComplete`.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data including user profiles, claim submissions, and admin operations, with canister-stopped error normalization.",
  "frontend/src/hooks/useScratchCanvas.ts": "Custom hook that manages a scratch-card canvas, handling drawing, pointer events, progress calculation, and triggering a reveal callback when a configurable threshold of the overlay is scratched away.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind directives, CSS design tokens (colors, radii, brand variables), and component-level styles for the scratch card UI including backgrounds, card faces, and typography.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page displaying all submissions with filtering/stats, and a coupon verification panel that allows searching by code and marking submissions as redeemed.",
  "frontend/src/pages/ScratchPage.tsx": "Main user-facing page orchestrating the scratch card flow: intro animation, scratch interaction, reward reveal, claim form, confetti, confirmation notification, and admin login modal.",
  "frontend/src/utils/audioGenerator.ts": "Utility module that generates and plays procedural scratch noise and winning chime sounds using the Web Audio API.",
  "frontend/src/utils/rewardGenerator.ts": "Generates weighted random reward outcomes (₹10/₹20/₹30/₹100 or 'better luck') and unique coupon codes in the format VW-XXXX-XXXX.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, colors (including brand 'vitalis' palette), shadows, border radii, and keyframe animations for the frontend.",
  "project_state.json": "Project state document describing a mobile-first Scratch & Win reward site for 'Vitalist Water', including architecture notes, reward probabilities, known issues, and a list of existing features."
}