{
  "backend/main.mo": "Motoko actor defining the backend for a scratch-and-win app, with persistent stores for coupon submissions and user profiles, role-based access control (admin/user), and CRUD operations for claims and reward stats.",
  "feature_evidence.json": "Feature evidence report documenting a single feature task: diagnosing and fixing the runtime error in the ClaimForm submit flow, referencing the affected files and test ID REQ-25.",
  "frontend-file-summaries.txt": "JSON-formatted text file containing one-sentence summaries of every frontend source file, serving as a build-planning reference for the project's React/TypeScript frontend.",
  "frontend/index.css": "Tailwind CSS entry file that defines CSS custom property tokens for light and dark themes (colors, radius, sidebar, charts) and applies base border and background styles.",
  "frontend/index.html": "Minimal HTML shell for the Vitalis Water Scratch & Win app, mounting the React app at #root and loading the Vite entry point.",
  "frontend/src/App.tsx": "Root React component that performs simple client-side routing via popstate, rendering ScratchPage at '/' and AdminPanel at '/admin'.",
  "frontend/src/components/AdminLoginModal.tsx": "Modal dialog component for admin login that validates hardcoded email/password credentials and calls onSuccess or displays an inline error message.",
  "frontend/src/components/ClaimForm.tsx": "Glassmorphism claim form collecting state, city, UPI ID, and feedback, wired to the useSubmitClaim mutation with inline error display and a loading spinner during submission.",
  "frontend/src/components/Confetti.tsx": "Canvas-based confetti animation component that renders 120 colored particles with physics over 3.5 seconds and plays a winning chime when triggered.",
  "frontend/src/components/ConfirmationNotification.tsx": "Displays an animated confirmation notification card when a reward is claimed, showing the amount and auto-closing after 6 seconds with entrance/ripple animations.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with the Vitalis Water logo, copyright year, tagline, and a referral link to caffeine.ai.",
  "frontend/src/components/Hero.tsx": "Renders the hero section with a 'Scan. Scratch. Win.' tagline, a bottle image with emoji fallback, and a subtitle.",
  "frontend/src/components/Logo.tsx": "Renders the Vitalis Water logo image with a text/emoji fallback and an optional double-click handler.",
  "frontend/src/components/RewardReveal.tsx": "Displays a reward reveal card showing the won amount and a button to scroll down to the claim form.",
  "frontend/src/components/ScratchCard.tsx": "Renders an interactive scratch card with a canvas overlay that reveals the reward amount and coupon code when the user scratches 60% of the surface.",
  "frontend/src/components/WaterDropIntro.tsx": "Renders a full-screen canvas intro animation with falling water drops and a gradient background, calling onComplete when the 2.2-second animation finishes.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including fetching/saving user profiles, submitting claims, retrieving submissions, reward stats, and marking claims as redeemed.",
  "frontend/src/hooks/useScratchCanvas.ts": "Custom React hook that manages a scratch-card canvas, handling drawing, progress calculation, and triggering a reveal callback when a configurable threshold of the overlay is scratched away.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind, imports Google Fonts, defines CSS design tokens (colors, radii, brand variables), and provides component-level styles for the scratch card UI.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page that displays all reward submissions with stats, supports coupon code verification, and allows marking coupons as redeemed via backend queries.",
  "frontend/src/pages/ScratchPage.tsx": "Main user-facing page that orchestrates the scratch card flow: intro animation, scratch interaction, reward reveal, claim form, confetti, and admin login modal.",
  "frontend/src/utils/audioGenerator.ts": "Provides two Web Audio API functions: a short noise-burst scratch sound and a four-note winning chime, both failing silently if audio is unsupported.",
  "frontend/src/utils/rewardGenerator.ts": "Exports a weighted random reward amount generator (₹10–₹100) and a unique coupon code generator in the format VW-XXXX-XXXX.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routes, with helpers to persist, retrieve, and clear values via sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Inter, Poppins), CSS-variable-based color tokens (including Vitalis brand colors), border radii, box shadows, and custom keyframe animations. Registers the tailwindcss-animate, @tailwindcss/typography, and @tailwindcss/container-queries plugins.",
  "project_state.json": "Project state document (version 13) describing a mobile-first Scratch & Win reward site for 'Vitalist Water', including feature list, reward probability weights, admin panel credentials, architectural constraints (pure HTML/CSS/JS, Google Sites embeddable), and known UI/functionality issues to fix."
}