{
  "backend/main.mo": "Motoko actor defining the backend for the Vitalis Water Scratch & Win app, with stable maps for submissions and user profiles, and endpoints for submitting claims, querying/filtering submissions, marking redemptions, and managing user profiles with basic access control.",
  "feature_evidence.json": "Feature evidence report linking a single feature (end-to-end claim submission persistence and retrieval fix) to its affected file `useQueries.ts`, related components, and test ID REQ-31.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference index for the project's React/TypeScript frontend components, hooks, pages, and utilities.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind base/components/utilities and defines CSS custom property tokens for light and dark themes covering colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, mounting the React root into `<div id='root'>` and loading `src/main.tsx` as an ES module.",
  "frontend/src/App.tsx": "Root React component managing navigation between the ScratchPage and AdminPanel views, handling admin authentication state via sessionStorage, and wiring browser history popstate events.",
  "frontend/src/components/AdminLoginModal.tsx": "Modal dialog component for admin login that validates hardcoded email/password credentials and calls `onSuccess` or displays an error message on failure.",
  "frontend/src/components/ClaimForm.tsx": "Glassmorphism claim form component collecting state, city, UPI ID, and feedback fields, then invoking the `useSubmitClaim` mutation with all required fields and displaying success or user-friendly error states.",
  "frontend/src/components/Confetti.tsx": "Renders a canvas-based confetti animation with particles when `triggered` is true, and plays a winning chime sound once on trigger.",
  "frontend/src/components/ConfirmationNotification.tsx": "Displays an animated confirmation overlay card with a checkmark, reward amount, and coin animations that auto-closes after 6 seconds.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with the Vitalis logo, copyright year, tagline, and a referral link to caffeine.ai.",
  "frontend/src/components/Hero.tsx": "Displays the hero section with a 'Scan. Scratch. Win.' tagline, a bottle image with emoji fallback, and a subtitle.",
  "frontend/src/components/Logo.tsx": "Renders the Vitalis Water logo image with a text/emoji fallback and an optional double-click handler.",
  "frontend/src/components/RewardReveal.tsx": "Shows a reward card displaying the won amount in rupees and a button to scroll down to the claim form.",
  "frontend/src/components/ScratchCard.tsx": "Renders an interactive scratch card with a canvas overlay that reveals the reward amount and coupon code as the user scratches past a 60% threshold.",
  "frontend/src/components/WaterDropIntro.tsx": "Animates a full-screen canvas intro with falling water drops over a gradient background for ~2.2 seconds, then calls `onComplete`.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, AuthClient management, and status tracking via a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data including user profiles, claim submissions, and admin operations, with canister-stopped error normalization.",
  "frontend/src/hooks/useScratchCanvas.ts": "Custom hook that manages a scratch-card canvas, handling drawing logic, pointer events, progress calculation, and triggering a reveal callback when a configurable threshold is reached.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind directives, CSS design tokens (colors, radii, brand variables), and component-specific styles for the scratch card UI.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page displaying all submissions with filtering/stats, and a coupon verification panel that allows searching and marking coupons as redeemed.",
  "frontend/src/pages/ScratchPage.tsx": "Main user-facing page orchestrating the scratch card flow: intro animation, scratch interaction, reward reveal, claim form, confetti, and admin login modal.",
  "frontend/src/utils/audioGenerator.ts": "Utility module that generates and plays procedural scratch noise and winning chime sounds using the Web Audio API.",
  "frontend/src/utils/rewardGenerator.ts": "Utility that generates a weighted random reward amount (₹10–₹100) and a unique coupon code string in the format VW-XXXX-XXXX.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist/retrieve values via sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, colors (including brand 'vitalis' palette), border radii, box shadows, keyframe animations, and enabling the animate, typography, and container-queries plugins.",
  "project_state.json": "Project state snapshot describing a mobile-first Scratch & Win reward site for 'Vitalist Water', including architectural decisions, weighted reward distribution, admin panel details, and a list of known bugs to fix."
}