{
  "kind": "build_request",
  "title": "Update reward probability distribution with 'Better Luck Next Time' outcome",
  "projectName": "Vitalist Water Scratch & Win",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Update the weighted reward probability in frontend/src/utils/rewardGenerator.ts to the following distribution: 40% chance of ₹10, 40% chance of 'Better Luck Next Time' (no monetary reward), 18% chance of ₹20, 0.01% chance of ₹100, and the remaining ~1.99% chance of ₹30. Remove all other reward amounts. The generator must return a discriminated result — either a numeric reward amount or a special 'better_luck' sentinel value — so the rest of the UI can branch accordingly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "set as 40 percentage of time if scarcth amount is 10 and 40 percentage better luck next time and 18 percentage of time 20 ruppes and 0.01 percentage 100rs else 30 rupees"
        ]
      },
      "acceptanceCriteria": [
        "Over a large sample (e.g., 10,000 runs), ₹10 appears approximately 40% of the time.",
        "Over a large sample, 'Better Luck Next Time' appears approximately 40% of the time.",
        "Over a large sample, ₹20 appears approximately 18% of the time.",
        "Over a large sample, ₹100 appears approximately 0.01% of the time.",
        "Over a large sample, ₹30 appears for the remaining ~1.99% of cases.",
        "No reward amounts other than ₹10, ₹20, ₹30, ₹100, and the 'better_luck' outcome are ever returned.",
        "The generator function returns a typed result that clearly distinguishes a monetary reward from the 'Better Luck Next Time' outcome."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Update ScratchPage.tsx, ScratchCard.tsx, and RewardReveal.tsx to handle the 'Better Luck Next Time' outcome gracefully. When the scratch result is 'better_luck': (1) display a consolation message such as 'Better Luck Next Time!' prominently on the revealed scratch card face instead of a reward amount; (2) do NOT show the RewardReveal section, ClaimForm, or the 'Click to Claim Your Reward' button; (3) do NOT trigger confetti; (4) show a friendly styled card with the consolation message and the unique coupon code. When the result is a monetary amount, the existing flow (reward reveal, claim form, confetti) continues as normal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "40 percentage better luck next time"
        ]
      },
      "acceptanceCriteria": [
        "When a 'Better Luck Next Time' outcome is generated, the scratch card face shows 'Better Luck Next Time!' text after scratching completes.",
        "When a 'Better Luck Next Time' outcome is generated, the RewardReveal section is not rendered in the DOM.",
        "When a 'Better Luck Next Time' outcome is generated, the ClaimForm is not rendered in the DOM.",
        "When a 'Better Luck Next Time' outcome is generated, the confetti animation does not fire.",
        "When a 'Better Luck Next Time' outcome is generated, the unique VW-XXXX-XXXX coupon code is still displayed on the consolation card.",
        "When a monetary reward amount is generated, the full existing claim flow (reward reveal, claim form, confetti) works as before."
      ]
    }
  ],
  "constraints": [
    "Do not change any existing backend Motoko functions or data models.",
    "Do not modify any files listed in frontend.immutablePaths.",
    "Reward amounts must be strictly limited to ₹10, ₹20, ₹30, ₹100, and the 'Better Luck Next Time' outcome — no other values."
  ],
  "nonGoals": [
    "Adding any new backend endpoints or schema changes.",
    "Changing the admin panel UI or login flow.",
    "Modifying the confetti colors or sound effects.",
    "Changing the scratch card visual design or glassmorphism styling."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}