{
  "kind": "build_request",
  "title": "Fix submit button error on claim form submission",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Diagnose and fix the runtime error thrown when the user clicks the 'Submit' button on the ClaimForm. Inspect the useSubmitClaim hook in useQueries.ts and the ClaimForm component to identify the exact failure point (e.g., missing or undefined actor, incorrect argument shape passed to the backend submitClaim function, type mismatch between frontend payload and Motoko actor method signature). Ensure the mutation is called with all required fields (couponCode, rewardAmount, state, city, feedback, upiId) with correct types, error boundaries are in place, and the error is surfaced to the user with a visible inline message rather than a silent failure or crash.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "AFTER I CLICK ON SUBMIT THERE IS A ERROR PLEASE FIX IT"
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Submit' on a fully filled-out claim form does not throw a runtime error or crash the page.",
        "The useSubmitClaim mutation correctly calls the backend submitClaim actor method with the correct argument types matching the Motoko function signature.",
        "If the backend call fails for any reason, an inline error message is displayed to the user inside the ClaimForm without crashing.",
        "On a successful submission, the ConfirmationNotification component is shown and the form is hidden.",
        "Loading state is visible on the Submit button while the mutation is in progress (e.g., spinner or disabled state)."
      ]
    }
  ],
  "constraints": [
    "Do not change the Motoko backend actor method signature unless a type mismatch is the confirmed root cause.",
    "Do not modify files under frontend/src/hooks/useActor.ts or frontend/src/hooks/useInternetIdentity.ts."
  ],
  "nonGoals": [
    "Redesigning the claim form UI.",
    "Adding new form fields.",
    "Changing reward logic or scratch card behaviour."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}