{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update reward probability distribution with 'Better Luck Next Time' outcome",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Update the weighted reward probability in rewardGenerator.ts to include a 40% 'Better Luck Next Time' outcome alongside updated monetary reward probabilities (40% ₹10, 18% ₹20, ~1.99% ₹30, 0.01% ₹100), returning a discriminated union result",
      "acceptanceCriteria": [
        "Over a large sample (e.g., 10,000 runs), ₹10 appears approximately 40% of the time.",
        "Over a large sample, 'Better Luck Next Time' appears approximately 40% of the time.",
        "Over a large sample, ₹20 appears approximately 18% of the time.",
        "Over a large sample, ₹100 appears approximately 0.01% of the time.",
        "Over a large sample, ₹30 appears for the remaining ~1.99% of cases.",
        "No reward amounts other than ₹10, ₹20, ₹30, ₹100, and the 'better_luck' outcome are ever returned.",
        "The generator function returns a typed result that clearly distinguishes a monetary reward from the 'Better Luck Next Time' outcome."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/rewardGenerator.ts",
          "operation": "modify",
          "description": "Refactor generateReward() to return a discriminated union type (either { type: 'reward', amount: number } or { type: 'better_luck' }) instead of a plain number. Update the weighted random logic to: 40% chance of ₹10, 40% chance of 'better_luck', 18% chance of ₹20, 0.01% chance of ₹100, and ~1.99% chance of ₹30. Remove all other reward amounts. Preserve the existing generateCouponCode() function unchanged."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Handle the 'Better Luck Next Time' outcome in ScratchPage, ScratchCard, and RewardReveal by displaying a consolation message without triggering the reward claim flow or confetti animation",
      "acceptanceCriteria": [
        "When a 'Better Luck Next Time' outcome is generated, the scratch card face shows 'Better Luck Next Time!' text after scratching completes.",
        "When a 'Better Luck Next Time' outcome is generated, the RewardReveal section is not rendered in the DOM.",
        "When a 'Better Luck Next Time' outcome is generated, the ClaimForm is not rendered in the DOM.",
        "When a 'Better Luck Next Time' outcome is generated, the confetti animation does not fire.",
        "When a 'Better Luck Next Time' outcome is generated, the unique VW-XXXX-XXXX coupon code is still displayed on the consolation card.",
        "When a monetary reward amount is generated, the full existing claim flow (reward reveal, claim form, confetti) works as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ScratchPage.tsx",
          "operation": "modify",
          "description": "Update ScratchPage to handle the discriminated union result from generateReward(). Store both the result type and reward amount (if applicable) in state. Conditionally render RewardReveal and ClaimForm only when result.type === 'reward'. Only trigger confetti when result.type === 'reward'. Pass the result type to ScratchCard so it knows whether to display a monetary amount or the consolation message after scratching completes."
        },
        {
          "path": "frontend/src/components/ScratchCard.tsx",
          "operation": "modify",
          "description": "Update ScratchCard to accept a new prop indicating the result type. When rendering the revealed card content, conditionally display either the reward amount (for type 'reward') or 'Better Luck Next Time!' text (for type 'better_luck'). In both cases, continue to display the coupon code. Apply appropriate styling to the consolation message to maintain the glassmorphism aesthetic and ensure it is prominent and friendly."
        }
      ]
    }
  ]
}