{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix submit button error on claim form submission",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Diagnose and fix the runtime error when submitting the ClaimForm by ensuring the useSubmitClaim mutation correctly calls the backend submitClaim method with proper argument types, includes error boundaries, and displays inline error messages",
      "acceptanceCriteria": [
        "Clicking 'Submit' on a fully filled-out claim form does not throw a runtime error or crash the page.",
        "The useSubmitClaim mutation correctly calls the backend submitClaim actor method with the correct argument types matching the Motoko function signature.",
        "If the backend call fails for any reason, an inline error message is displayed to the user inside the ClaimForm without crashing.",
        "On a successful submission, the ConfirmationNotification component is shown and the form is hidden.",
        "Loading state is visible on the Submit button while the mutation is in progress (e.g., spinner or disabled state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useSubmitClaim mutation to ensure it calls actor.submitClaim with all six required arguments (couponCode, rewardAmount, state, city, feedback, upiId) in the correct order and with correct types. Ensure rewardAmount is passed as a BigInt. Add proper error handling that captures and returns the error message for display in the UI. Verify the mutation's onError callback properly propagates the error to the component."
        },
        {
          "path": "frontend/src/components/ClaimForm.tsx",
          "operation": "modify",
          "description": "Update the ClaimForm component to properly handle errors from the useSubmitClaim mutation. Ensure the mutation is called with all required fields (couponCode, rewardAmount, state, city, feedback, upiId) and that rewardAmount is converted to BigInt before passing. Add inline error display UI that shows the error message below the submit button when submission fails. Ensure the loading state on the submit button is properly wired to the mutation's isPending state. Verify that the ConfirmationNotification is shown only on successful submission."
        }
      ]
    }
  ]
}